MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMR30G18A/mcu.h
#define FLASH_ADDR                     _UL_(0x00000000)    /* FLASH base address (type: flash)*/
#define CAL_ADDR                       _UL_(0x00800000)    /* CAL base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UL_(0x00802000)    /* LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UL_(0x00806000)    /* OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UL_(0x00806008)    /* OTP2 base address (type: fuses)*/
#define OTP3_ADDR                      _UL_(0x00806010)    /* OTP3 base address (type: fuses)*/
#define OTP4_ADDR                      _UL_(0x00806018)    /* OTP4 base address (type: fuses)*/
#define OTP5_ADDR                      _UL_(0x00806020)    /* OTP5 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UL_(0x00806030)    /* TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UL_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define RWW_ADDR                       _UL_(0x00400000)    /* RWW base address (type: flash)*/
#define HSRAM_ADDR                     _UL_(0x20000000)    /* HSRAM base address (type: ram)*/
#define LPRAM_ADDR                     _UL_(0x30000000)    /* LPRAM base address (type: ram)*/
#define HPB0_ADDR                      _UL_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UL_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UL_(0x42000000)    /* HPB2 base address (type: io)*/
#define HPB3_ADDR                      _UL_(0x43000000)    /* HPB3 base address (type: io)*/
#define HPB4_ADDR                      _UL_(0x44000000)    /* HPB4 base address (type: io)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /* PPB base address (type: io)*/
#define SCS_ADDR                       _UL_(0xe000e000)    /* SCS base address (type: io)*/
#define PERIPHERALS_ADDR               _UL_(0x40000000)    /* PERIPHERALS base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR SAMR30G18A                                         */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UL_(0X1081021E)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR SAMR30G18A                                    */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for SAMR30G18A */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_CMP_0                            1 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            2 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              3 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            4 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        12 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        13 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        14 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        15 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        16 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        17 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        18 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        19 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        20 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        21 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       22 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       23 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       24 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       25 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       26 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       27 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           28 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           29 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           30 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           31 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_DMAC_CH_4                           32 /* ID for DMAC event generator CH_4 */
#define EVENT_ID_GEN_DMAC_CH_5                           33 /* ID for DMAC event generator CH_5 */
#define EVENT_ID_GEN_DMAC_CH_6                           34 /* ID for DMAC event generator CH_6 */
#define EVENT_ID_GEN_DMAC_CH_7                           35 /* ID for DMAC event generator CH_7 */
#define EVENT_ID_GEN_TCC0_OVF                            36 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            37 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            38 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           39 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           40 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           41 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           42 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC1_OVF                            43 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            44 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            45 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           46 /* ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           47 /* ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_OVF                            48 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            49 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            50 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           51 /* ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           52 /* ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TC0_OVF                             53 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            54 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            55 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             56 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            57 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            58 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             65 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            66 /* ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            67 /* ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          68 /* ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          69 /* ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           70 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           71 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            72 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        78 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        79 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                        80 /* ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                        81 /* ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          82 /* ID for PAC event generator ACCERR */

/* ************************************************************************** */
/*  Event User IDs for SAMR30G18A */
/* ************************************************************************** */
#define EVENT_ID_USER_PORT_EV_0                           0 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           1 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           2 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           3 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           4 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           5 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           6 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           7 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                           8 /* ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                           9 /* ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                          10 /* ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                          11 /* ID for DMAC event user CH_7 */
#define EVENT_ID_USER_TCC0_EV_0                          12 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          13 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          14 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          15 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          16 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          17 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC1_EV_0                          18 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          19 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          20 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          21 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC2_EV_0                          22 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          23 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          24 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          25 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TC0_EVU                            26 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            27 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            30 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_ADC_START                          31 /* ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                           32 /* ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           33 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           34 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_CCL_LUTIN_0                        38 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        39 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        40 /* ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        41 /* ID for CCL event user LUTIN_3 */
#define EVENT_ID_USER_MTB_START                          43 /* ID for MTB event user START */
#define EVENT_ID_USER_MTB_STOP                           44 /* ID for MTB event user STOP */

#ifdef __cplusplus
}
#endif

#endif /* _SAMR30G18A_H_ */

